#include <iostream>  // бібліотека для виведення на екран

int main()				// початок програми на  С++
{
	long X = 3;			// змінна для аргументу
	long REZ;			// змінна для результату

	_asm {				// початок асемблерної вставки

		lea EBX, REZ; завантаження адреси результатів в регістр EBX
		mov EAX, 4; EAX = 4
		imul X; EAX = 4 * x
		add EAX, 5; EAX = 4 * x + 5
		mov EDI, EAX; пересилання знаменника в регістр EDI
		mov EAX, 15; EAX = 15
		imul X; EAX = 15 * x
		imul X; EAX = 15 * x ^ 2
		sub EAX, 12; EAX = 15 * x ^ 2 - 12
		cdq; розширення операнда - ділимого в EAX - EDX
		div EDI; частка – EAX, залишок – EDX
		shr EDI, 1; ділення знаменника на 2
		cmp EDI, EDX; порівняння половини дільника з залишком
		adc EAX, 0; додавання до частки за позиченням від порівняння
		mov dword ptr[EBX], EAX; пересилання результату в пам’ять

	}	// закінчення асемблерної вставки

	// Виведення результату на екран
	std::cout << "Result: " << REZ << std::endl;

	return 0;
}
